Repository: ami-megarac/OSSW-LTS-v13
Catalog: Core/UnModified_OpenSource/pam/pam-1.3.1/debian/po/*.po
Languages: tr

source: Services to restart for PAM library upgrade:
tr: PAM kitaplığının yükseltilmesi için yeniden başlatılacak olan hizmetler:

source: Most services that use PAM need to be restarted to use modules built for this new version of libpam. Please review the following space-separated list of init.d scripts for services to be restarted now, and correct it if needed.
tr: PAM kullanan çoğu hizmet, libpam'ın bu yeni sürümü için derlenmiş modüllerden yararlanabilmek için yeniden başlatılmak zorunda. Lütfen yeniden başlatılacak hizmetlere ilişkin init.d betiklerinin boşluklarla ayrılmış aşağıdaki listesini inceleyin ve gerekliyse listeyi düzeltin.

source: Display manager must be restarted manually
tr: Görüntü yöneticisinin elle yeniden başlatılması gerekli

source: The wdm and xdm display managers require a restart for the new version of libpam, but there are X login sessions active on your system that would be terminated by this restart. You will therefore need to restart these services by hand before further X logins will be possible.
tr: wdm ve xdm görüntü yöneticileri, libpam'ın yeni sürümünden yararlanabilmek için yeniden başlatılmalı; fakat sisteminizde etkin X oturumları var. Görüntü yöneticisi yeniden başlatılırsa bu oturumlar da kapatılır. Bu yüzden ileride yeni X oturumları açabilmek için bu hizmetleri elle yeniden başlatmanız gerekecek.

source: Failure restarting some services for PAM upgrade
tr: Bazı hizmetler PAM yükseltmesi için yeniden başlatılamadı

source: The following services could not be restarted for the PAM library upgrade:
tr: Aşağıdaki hizmetler PAM kitaplığının yükseltmesi için yeniden başlatılamadı:

source: You will need to start these manually by running '/etc/init.d/<service> start'.
tr: Bu hizmetleri '/etc/init.d/<hizmet> start' komutunu kullanarak elinizle başlatmanız gerekecek.

source: Restart services during package upgrades without asking?
tr: Paket yükseltme esnasında hizmetler sorulmadan yeniden başlatılsın mı?

source: There are services installed on your system which need to be restarted when certain libraries, such as libpam, libc, and libssl, are upgraded. Since these restarts may cause interruptions of service for the system, you will normally be prompted on each upgrade for the list of services you wish to restart. You can choose this option to avoid being prompted; instead, all necessary restarts will be done for you automatically so you can avoid being asked questions on each library upgrade.
tr: Sisteminizde libpam, libc ve libssl gibi bazı kitaplıklar yükseltildiğinde yeniden başlatılması gereken bazı hizmetler kurulu. Yeniden başlatma işlemleri sisteminizin sunduğu hizmetlerde kesintilere neden olabileceğinden dolayı her yükseltme işlemi esnasında yeniden başlatmak istediğiniz hizmetler size sorulacaktır. Eğer bu sorunun sorulmasını istemiyorsanız bu seçeneği kullanabilirsiniz. Bu seçenek seçildiği takdirde bir kitaplık yükseltmesi yapılırken gereken tüm yeniden başlatma işlemleri size sorulmaksızın otomatik olarak yapılacaktır.

source: PAM configuration
tr: PAM yapılandırması

source: PAM profiles to enable:
tr: Etkinleştirilecek PAM profilleri:

source: Pluggable Authentication Modules (PAM) determine how authentication, authorization, and password changing are handled on the system, as well as allowing configuration of additional actions to take when starting user sessions.
tr: Takılabilir Doğrulama Modülleri (PAM), sistemdeki kimlik doğrulama, izin verme ve parola değiştirme işlemlerinin ne şekilde idare edileceğine karar veren ve ayrıca kullanıcı oturumları başlatılırken atılması gereken adımları yapılandırmaya yarayan bir sistemdir.

source: Some PAM module packages provide profiles that can be used to automatically adjust the behavior of all PAM-using applications on the system. Please indicate which of these behaviors you wish to enable.
tr: Bazı PAM modül paketleri, sistemde mevcut olan ve PAM kullanan tüm uygulamaların davranışlarını otomatik olarak ayarlamaya yarayan profiller sağlar. Lütfen bu davranışlardan hangisini etkinleştirmek istediğinizi belirtin.

source: Incompatible PAM profiles selected.
tr: Uyumsuz PAM profilleri seçildi

source: The following PAM profiles cannot be used together:
tr: Şu PAM profilleri birarada kullanılamaz:

source: Please select a different set of modules to enable.
tr: Lütfen farklı bir modül kümesi seçin.

source: Override local changes to /etc/pam.d/common-*?
tr: /etc/pam.d/common-* konumundaki yerel değişiklikler görmezden gelinsin mi?

source: One or more of the files /etc/pam.d/common-{auth,account,password,session} have been locally modified. Please indicate whether these local changes should be overridden using the system-provided configuration. If you decline this option, you will need to manage your system's authentication configuration by hand.
tr: /etc/pam.d/common-{auth,account,password,session} dosyalarından bir ya da daha fazlası yerel olarak değiştirilmiş. Lütfen bu yerel değişikliklerin sistem tarafından sağlanan yapılandırma ile değiştirilmesine izin verip vermediğinizi belirtin. Bu seçeneği kabul etmediğiniz takdirde sistemin kimlik doğrulama yapılandırmasını elinizle ayarlamanız gerekecektir.

source: No PAM profiles have been selected.
tr: Hiçbir PAM profili seçilmedi.

source: No PAM profiles have been selected for use on this system. This would grant all users access without authenticating, and is not allowed. Please select at least one PAM profile from the available list.
tr: Sistemde kullanılmak üzere hiçbir PAM modülü seçilmedi. Bu durum tüm kullanıcılara hiçbir kimlik doğrulamaya maruz kalmaksızın erişim izni verilmesi anlamına gelir ve bu duruma izin verilmemektedir. Lütfen mevcut profiller listesinden en az bir PAM profili seçin.

source: xscreensaver and xlockmore must be restarted before upgrading
tr: Yükseltme işleminden önce xscreensaver ve xlockmore yeniden başlatılmalı

source: One or more running instances of xscreensaver or xlockmore have been detected on this system. Because of incompatible library changes, the upgrade of the libpam-modules package will leave you unable to authenticate to these programs. You should arrange for these programs to be restarted or stopped before continuing this upgrade, to avoid locking your users out of their current sessions.
tr: Sisteminizde çalışmakta olan birden fazla xscreensaver ya da xlockmore örneğine rastlandı. Uyumsuz kitaplık değişiklikleri yüzünden, libpam-modules paketinin yükseltilmesi bu programlarda kimlik doğrulamasını olanaksız hale getirecek. Mevcut oturumların kilitlenmesi önlemek için, yükseltme işlemine devam etmeden önce bu programları durdurmalı ya da yeniden başlatmalısınız.
